# Pandas Library Documentation

In [1]:
import pandas as pd
# Import the os module
import os

# Get the current working directory
os.getcwd()

'C:\\Users\\Shivam Goyal\\Github\\Python'

In [2]:
# Change the current working directory
# os.chdir('/tmp')

In [3]:
# from platform import python_version
# print(python_version())

## 1. Reading data from various file formats

### 1.1 Read a CSV File

In [53]:
path = "D:/UoW/Semester 1/Quantitative Studies -BSMM 8320/Excel Projects/Project 2/"

In [54]:
filename1 = "squark_automotive_CLV_training_data.csv"

In [55]:
# cols = ['CustomerID', 'State', 'CLV', 'Response', 'Coverage']
new_data = pd.read_csv(path + filename1, sep =",",header = 0)

In [ ]:
# data.columns = ['CustomerID', 'State', 'CLV', 'Response', 'Coverage']

In [ ]:
# Header to select header  and usecols to filter specific columns

pd.read_csv(path + filename1 , sep =",",header =0 ,usecols = ['Customer','State', 'Response', 'Coverage'])  # header can be None or a list

In [ ]:
# Usage of index_cols and set_index to change the column index of a dataframe

pd.read_csv(path + filename1 , sep =",",header =0 ,index_col= 0)

In [ ]:
# usage of names to change column names. We need to take all columns in data for names

pd.read_csv(path + filename1 , sep =",",header =1 ,names = ['CustomerID', 'State', 'CLV', 'Response', 'Coverage'])

### 1.2 Slicing a dataset

In [ ]:
# Filtering the dataset using indexing iloc vs loc

new_data.iloc[:100,:2]
new_data.iloc[[1,7,3],[2,3]]

new_data.loc[:34,['Customer','State']]
new_data.loc[[1,7,3],['Response','State']]

In [ ]:
# Multiple filtering operations
new_data[(new_data['Customer Lifetime Value']>20600.23958) | (new_data['EmploymentStatus'] =="Medical Leave") ]

In [ ]:
# Multiple filtering operations using lambda
new_data.groupby(['State','Gender','EmploymentStatus']).sum(
    ).loc[lambda new_data: new_data['Customer Lifetime Value'] > 7000].reset_index()

In [7]:
new_data.describe()

,Customer Lifetime Value,Income,Monthly Premium Auto,Months Since Last Claim,Months Since Policy Inception,Number of Open Complaints,Number of Policies,Total Claim Amount
count,8099.000000,8099.000000,8099.000000,8099.000000,8099.000000,8099.000000,8099.000000,8099.000000
mean,7981.271398,37843.544265,93.140758,15.071490,48.147549,0.389184,2.963823,431.464401
std,6847.287340,30370.556860,34.381153,10.086656,27.818744,0.914152,2.390357,286.706233
min,1898.007675,0.000000,61.000000,0.000000,0.000000,0.000000,1.000000,0.099007
25%,3974.498315,0.000000,68.000000,6.000000,25.000000,0.000000,1.000000,269.484578
50%,5780.182197,34430.000000,83.000000,14.000000,48.000000,0.000000,2.000000,383.167471
75%,8963.294993,62459.500000,109.000000,23.000000,71.000000,0.000000,4.000000,547.200000
max,83325.381190,99981.000000,298.000000,35.000000,99.000000,5.000000,9.000000,2893.239678

In [8]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8099 entries, 0 to 8098
Data columns (total 24 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Customer                       8099 non-null   object
 1   State                          35 non-null     object
 2   Customer Lifetime Value        8099 non-null   float64
 3   Response                       8099 non-null   object
 4   Coverage                       8099 non-null   object
 5   Education                      8099 non-null   object
 6   Effective To Date              8099 non-null   object
 7   EmploymentStatus               8099 non-null   object
 8   Gender                         8099 non-null   object
 9   Income                         8099 non-null   int64
 10  Location Code                  8099 non-null   object
 11  Marital Status                 8099 non-null   object
 12  Monthly Premium Auto           8099 non-null   int64
 13  Months Since Last Claim        8099 non-null   int64
 14  Months Since Policy Inception  8099 non-null   int64
 15  Number of Open Complaints      8099 non-null   int64
 16  Number of Policies             8099 non-null   int64
 17  Policy Type                    8099 non-null   object
 18  Policy                         8099 non-null   object
 19  Renew Offer Type               8099 non-null   object
 20  Sales Channel                  8099 non-null   object
 21  Total Claim Amount             8099 non-null   float64
 22  Vehicle Class                  8099 non-null   object
 23  Vehicle Size                   8099 non-null   object
dtypes: float64(2), int64(6), object(16)
memory usage: 1.5+ MB

In [12]:
# Separate numeric and non-numeric columns of a dataframe

new_data.select_dtypes(include = object)

# new_data.select_dtypes(exclude = object)

,Customer,State,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,Location Code,Marital Status,Policy Type,Policy,Renew Offer Type,Sales Channel,Vehicle Class,Vehicle Size
0,BU79786,Washington,No,Basic,Bachelor,2/24/2011,Employed,F,Suburban,Married,Corporate Auto,Corporate L3,Offer1,Agent,Two-Door Car,Medsize
1,QZ44356,Arizona,No,Extended,Bachelor,1/31/2011,Unemployed,F,Suburban,Single,Personal Auto,Personal L3,Offer3,Agent,Four-Door Car,Medsize
2,AI49188,Nevada,No,Premium,Bachelor,2/19/2011,Employed,F,Suburban,Married,Personal Auto,Personal L3,Offer1,Agent,Two-Door Car,Medsize
3,WW63253,California,No,Basic,Bachelor,1/20/2011,Unemployed,M,Suburban,Married,Corporate Auto,Corporate L2,Offer1,Call Center,SUV,Medsize
4,HB64268,Washington,No,Basic,Bachelor,02-03-2011,Employed,M,Rural,Single,Personal Auto,Personal L1,Offer1,Agent,Four-Door Car,Medsize
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8094,UH22701,NaN,No,Extended,Master,01-01-2011,Employed,F,Suburban,Married,Personal Auto,Personal L3,Offer2,Call Center,Four-Door Car,Medsize
8095,IA85970,NaN,No,Basic,Bachelor,02-07-2011,Unemployed,F,Urban,Divorced,Personal Auto,Personal L3,Offer1,Branch,SUV,Medsize
8096,TC18240,NaN,No,Basic,College,1/29/2011,Employed,M,Urban,Married,Personal Auto,Personal L3,Offer1,Agent,Four-Door Car,Medsize
8097,GE58317,NaN,Yes,Basic,College,1/31/2011,Employed,F,Suburban,Divorced,Personal Auto,Personal L3,Offer2,Call Center,Four-Door Car,Medsize
8098,GW42895,NaN,No,Basic,Bachelor,1/25/2011,Employed,F,Urban,Married,Personal Auto,Personal L3,Offer2,Agent,Four-Door Car,Medsize

In [13]:
# How to set a column as a row index

new_data.set_index("Customer",inplace=True)

In [14]:
# Get the names of the columns
new_data.columns

Index(['State', 'Customer Lifetime Value', 'Response', 'Coverage', 'Education',
       'Effective To Date', 'EmploymentStatus', 'Gender', 'Income',
       'Location Code', 'Marital Status', 'Monthly Premium Auto',
       'Months Since Last Claim', 'Months Since Policy Inception',
       'Number of Open Complaints', 'Number of Policies', 'Policy Type',
       'Policy', 'Renew Offer Type', 'Sales Channel', 'Total Claim Amount',
       'Vehicle Class', 'Vehicle Size'],
      dtype='object')

In [ ]:
# Create a list of columns
cols = ['CustomerID', 'State', 'CLV', 'Response', 'Coverage']

In [ ]:
# Change the name fo the column with a list of columns
new_data.columns = cols
new_data.columns

In [ ]:
# Access any column - 2 ways
new_data['Response'] #- way 1 
new_data.Response # - way 2

In [ ]:
# Looping using format functions
for i in new_data.columns:
#     print(i)
    print("The data type of {} is {}".format(i, new[i].dtype))

C:\Users\SHIVAM~1\AppData\Local\Temp/ipykernel_4980/3784257095.py:1: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  new_data.groupby(['Location Code','Gender']).agg(np.size)[{'Number of Open Complaints','Total Claim Amount'}]

                      Number of Open Complaints  Total Claim Amount
Location Code Gender
Rural         F                             901                 901
              M                             697                 697
Suburban      F                            2466                2466
              M                            2632                2632
Urban         F                             797                 797
              M                             606                 606

### 1.3 Reading data from an Excel file

In [15]:
# Read data from 2 separate sheets in the same excel file

b = pd.read_excel('C:/Users/Shivam Goyal/Github/titanic/Titanic.xlsx', header=0,sheet_name='train')


# dtype can be used to change data tyoe for a colums
a= pd.read_excel('C:/Users/Shivam Goyal/Github/titanic/Titanic.xlsx', index_col=0, header=0,sheet_name='test',
              dtype={'Name': str, 'SibSp': float}, na_values=['male']) # give NaN to some string

In [16]:
import numpy as np

In [22]:
b.groupby(['Sex','Embarked']).agg({"Fare":np.mean, "PassengerId":len}).reset_index()

      Sex Embarked       Fare  PassengerId
0  female        C  50.677050            2
1  female        S  19.894643            7
2    male        Q  18.791650            2
3    male        S  20.080357            7

In [23]:
b.groupby(['Sex','Embarked']).agg({max,min,np.mean})["Fare"].reset_index()

C:\Users\SHIVAM~1\AppData\Local\Temp/ipykernel_4980/1066139964.py:1: FutureWarning: ['Name', 'Ticket', 'Cabin'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  b.groupby(['Sex','Embarked']).agg({max,min,np.mean})["Fare"].reset_index()

      Sex Embarked      min       mean      max
0  female        C  30.0708  50.677050  71.2833
1  female        S   7.8542  19.894643  53.1000
2    male        Q   8.4583  18.791650  29.1250
3    male        S   7.2500  20.080357  51.8625

In [24]:
pd.pivot_table(data = b, index ='Embarked', columns ="Sex", values = "Fare", aggfunc='mean').reset_index().to_csv("test.csv")

Sex Embarked     female       male
0          C  50.677050        NaN
1          Q        NaN  18.791650
2          S  19.894643  20.080357

In [ ]:
b.apply(lambda x: x.describe(),axis =0)

b['Name'].map(lambda x:x.upper())

#### 1.3.1. Writing dataframe to an excel

In [ ]:
# Writing dataframe to Excel 
# Writing a single file
a.to_excel("output.xlsx",
             sheet_name='Output')

In [ ]:
# Writing multiple files
path = 'C:/Users/Shivam Goyal/Github/titanic/'
with pd.ExcelWriter(path +"output.xlsx") as writer:  
    a.to_excel(writer, sheet_name='Sheet_name_1')
    a.to_excel(writer, sheet_name='Sheet_name_2')

In [ ]:
# Append data in same sheet of Excel
# %pip install pandas==1.4.2 to use the "overlay function of excel writer"

with pd.ExcelWriter(path +"output.xlsx", mode="a", engine="openpyxl",if_sheet_exists="overlay") as writer:
    b.to_excel(writer, sheet_name='Sheet_name_1',startrow=376,header=False)

### 1.4 Fucntions in Pandas

In [ ]:
# mean,median,mode,correlation,count,max,min,std

In [ ]:
# df.columns = list("ABCDE")

In [ ]:
# dropping a column
new_data.drop('Customer',axis=1,inplace=True)

In [25]:
new_data['Customer Lifetime Value'].mean()

7981.271397766537

In [26]:
new_data['Customer Lifetime Value'].sum()

64640317.050511

In [27]:
new_data['Customer Lifetime Value'].count()

8099

In [28]:
# Check for unique values
new_data['State'].nunique(), new_data['State'].unique()

(5,
 array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
       dtype=object))

In [31]:
# Check for NAs in data
new_data.isna().sum()
# new_data.isnull().sum()

State                            8064
Customer Lifetime Value             0
Response                            0
Coverage                            0
Education                           0
Effective To Date                   0
EmploymentStatus                    0
Gender                              0
Income                              0
Location Code                       0
Marital Status                      0
Monthly Premium Auto                0
Months Since Last Claim             0
Months Since Policy Inception       0
Number of Open Complaints           0
Number of Policies                  0
Policy Type                         0
Policy                              0
Renew Offer Type                    0
Sales Channel                       0
Total Claim Amount                  0
Vehicle Class                       0
Vehicle Size                        0
dtype: int64

In [ ]:
# drop a columns
random_df.drop('E',axis=1,inplace=True)

In [32]:
# Values in a categorical variable
new_data['State'].value_counts()

California    10
Oregon        10
Arizona        6
Washington     5
Nevada         4
Name: State, dtype: int64

In [34]:
# Series in Pandas
d = {"b": 1, "a": 0, "c": 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [33]:
# Series in Pandas
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])

In [ ]:
# union all
pd.concat([df1, df4], ignore_index=True, sort=False)

In [ ]:
#inner join axis =1 along columns, axis =0 append rows
pd.concat([df1, df4], axis=1, join="inner")

In [ ]:
# Merge 2 Datasets
pd.merge(
    left,
    right,
    how="inner",
    on=None,
    left_on=None,
    right_on=None,
    left_index=False,
    right_index=False,
    sort=True,
    suffixes=("_x", "_y"),
    copy=True,
    indicator=False,
    validate=None,
)

In [ ]:
# merge(default inner) 2 data frames

pd.merge(left, right, how="left", on=["key1", "key2"]) # multi column join

In [ ]:
# join(default left) 2 data frames & the key to join is index unless specified otherwise
df.join(other, lsuffix='_caller', rsuffix='_other')

In [ ]:
#create a pivot table 

df.pivot(index="date", columns="variable", values="value")

In [ ]:
# stack(): “pivot” a level of the (possibly hierarchical) column labels, returning a DataFrame with an index with a new inner-most level of row labels.

# unstack(): (inverse operation of stack()) “pivot” a level of the (possibly hierarchical) row index to the column axis, producing a reshaped DataFrame with a new inner-most level of column labels.

df.stack()
df.unstack()

In [ ]:
# Cleaning / filling missing data
df.fillna(0)
df.fillna(df.mean()["B":"C"])

In [ ]:
# Dropping axis labels with missing data
# DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
df.dropna(axis=1,how='all')

In [ ]:
# ravel

In [ ]:
# Applying multiple functions at once
df["C"].agg([np.sum, np.mean, np.std]).rename(columns={"sum": "foo", "mean": "bar", "std": "baz"})
                                              
grouped["C"].agg([lambda x: x.max() - x.min(), lambda x: x.median() - x.mean()])

In [ ]:
# Applying different functions to DataFrame columns
grouped.agg({"C": np.sum, "D": lambda x: np.std(x, ddof=1)})

In [ ]:
# Using inverse operator (~) to take the complement of a mask
df[~((df.AAA <= 6) & (df.index.isin([0, 2, 4])))]

In [ ]:
# sort then take first of each

df.sort_values(by="BBB").groupby("AAA", as_index=False).first()
df.sort_values(by=("Labs", "II"), ascending=False)

In [ ]:
df.apply(lambda x: x.describe(),axis =0)
dff.groupby("B").filter(lambda x: len(x["C"]) > 2)

In [ ]:
df.applymap(lambda x: len(str(x)))